Repository: RedTurtle/collective.limitfilesizepanel
Catalog: collective/limitfilesizepanel/locales/*/LC_MESSAGES/collective.limitfilesizepanel.po
Languages: de, it

source: Cancel
de: Abbrechen
it: Annulla

source: Changes saved
de: Änderungen gespeichert
it: Modifiche salvate

source: Configure the file size limit from control panel
de: Konfigurieren Sie das Limit der Dateigrössen im in der Konfiguration
it: Configurazione del limite delle dimensioni dei file da pannello di controllo

source: Content type
it: Tipo di contenuto

source: Content/field settings
it: Impostazioni contenuto/campo

source: Edit cancelled
de: Bearbeiten abgebrochen
it: Modifiche annullate

source: Field name
it: Nome campo

source: Limit file size settings
de: Einstellungen zur Limitierung der Dateigrössen
it: Limita le dimensioni dei file

source: Limit files and images size
de: Datei- und Bildgrössen limitieren
it: Limita dimensione di file e immagini

source: Save
de: Speichern
it: Salva

source: Set the file-type size limit
de: Grössenlimitierung für Dateien
it: Imposta il limite per il tipo 'file'

source: Set the image-type size limit
de: Grössenlimitierung für Bilder
it: Imposta il limite per il tipo 'immagine'

source: Settings for other content types and fields
it: Impostazioni per altri tipi di contenuto e campi

source: Size limit
it: Limite dimensione

source: Type here a number in MB which will limit the field size upload
it: Scrivi un numero in MB per limitare le dimensioni del campo in upload

source: Type here a number in MB which will limit the file size upload
de: Geben Sie die Limitierung der Dateigrösse in MB an.
it: Scrivi un numero in MB per limitare le dimensioni dei file in upload

source: Type here a number in MB which will limit the image size upload
de: Geben Sie die Limitierung der Bildgrösse in MB an.
it: Scrivi un numero in MB per limitare le dimensioni delle immagini in upload

source: Validate only new data
de: Nur neue Dateien / Bilder validieren
it: Valida solo i nuovi dati

source: help_field_name
it: Nome del campo di basso livello, comunemente "image" o "file".

source: help_limit_file_size_panel
de: Grössenlimitierung für Dateien und Bilder konfigurieren
it: Imposta le dimensioni massime per i file e le immagini da caricare

source: help_new_data_only
it: Tieni selezionato per validare solo i nuovi dati caricati. Se verrà deselezionato e le configurazioni sopra saranno ridotte, potrebbe verificarsi il caso in cui utenti modifichino i contenuti ma non saranno in grado di salvare il form poiché il validatore sarà applicato anche ai dati già salvati.

source: help_types_settings
it: Utilizza questa sezione per sovrascrivere i valori delle dimensioni sopra. Fornisci un tipo di contenuto/ID del campo, e la dimensione limite.

source: validation_error
de: Die Hochgeladenen Daten sind zu gross: ${size}MB, maxmium erlaubt: ${max}MB
it: Validazione fallita. I dati caricati sono troppo grandi: ${size}MB (massimo ${max}MB)
